import React, { Component } from "react"
// import PropTypes from "prop-types"
import { withStyles } from "@material-ui/core/styles"
import Paper from "@material-ui/core/Paper"
import Typography from "@material-ui/core/Typography"
import classnames from "classnames"
import { styles, ServiceButton } from "../../utils"
import { Link } from "gatsby"
import styled from "styled-components"

const stylesTheme = theme => ({
  root: {
    ...theme.mixins.gutters(),
    paddingTop: theme.spacing(2),
    paddingBottom: theme.spacing(2),
  },
})
class CoachingTab_QnA_FR extends Component {
  render() {
    const { classes } = this.props
    return (
      <CoachingWrapper>
        <Paper className={classnames(classes.root, "paper")} elevation={20}>
          <Typography
            variant="h5"
            component="h3"
            className={classnames("intro", "introFR")}
          >
            پاسخ به سوالات متداول
          </Typography>
          <Typography component="h3" className={classnames("text", "textFR")}>
            اینها سوالاتی هستند که بصورت متداول از آریانا پرسیده می‌شوند. بعضی
            از سوال‌ها کمی تغییر داده شده‌اند تا بتوان جواب‌های کامل‌تری برای
            آنها ارایه داد.
            <br />
            <span style={{ borderBottom: "2px solid currentColor" }}>
              پاسخ این سوال‌ها را مستقیما از زبان آریانا می‌شنوید
            </span>
          </Typography>
          <Typography component="h3" className={classnames("text", "textFR")}>
            <br />
            <ul style={{ paddingRight: "1rem" }}>
              <li className="questions">
                <b>کوچینگ چیست؟</b>
              </li>
              <li style={{ listStyleType: "none" }}>
                من برای کارم از واژه «کوچینگ» و عنوان شغلی «کوچ زندگی و سلامت»
                استفاده می‌کنم اما راستش را بخواهید فکر می‌کنم این واژه‌ها
                معرف‌های واضح و کاملی برای شغل من نیستند! تنها دلیلی که از آنها
                استفاده می‌کنم این است که تاکنون واژه مناسب‌تری پیدا نکرده‌ام!
                البته واژه کوچینگ واژه نسبتا جا افتاده‌‌‌ای است که برخی افراد
                برای خدماتی مشابه من استفاده می‌کنند! بالاخره من هم باید یک
                عنوان شغلی داشته باشم و برای ارتباط برقرار کردن با شما از
                واژه‌های نسبتا شناخته شده‌ای استفاده کنم!
                <br />
                اگر کنجکاو هستید بدانید کوچینگ چیست یا کار یک کوچ زندگی چیست
                می‌توانید کلید واژه‌هایی «کوچینگ چیست» و یا «فرق کوچ با مشاور
                چیست» را در گوگل جستجو کنید تا جواب‌های تعریف شده و کلیشه‌ای را
                بیابید. اما اگر از من می‌شنوید خودتان را اسیر واژه‌ها و تعاریف
                نکنید، ذهن خود را خالی و کار با من را برای خود تجربه کنید! چرا
                که روش کاری من منحصر به فرد است و در هیچ چهارچوب یا جعبه از پیش
                تعریف شده‌ای نمی‌گنجد!
                <b style={{ color: "red" }}>
                  <br /> دعوتتان می‌کنم چند دقیقه‌ای وقت بگذارید و نظر
                  کلاینت‌هایی که تصمیم گرفتند وقت بگذارند و چند خطی از نتیجه
                  کوچینگ و تجربه کلی خود از کار با من را بنویسند، بخوانید.
                </b>{" "}
                <Link
                  to="/services"
                  style={{ textDecoration: "none" }}
                  state={{
                    link_tabNo: 4,
                  }}
                >
                  <ServiceButton
                    style={{ margin: " 0.5rem auto", fontFamily: "Vazir" }}
                  >
                    تجربه دیگران
                  </ServiceButton>
                </Link>
                <br />
                سوال من از شما این است: چه چیزی را با همه وجودتان، با تک تک
                سلولهای بدنتان، می خواهید در زندگیتان تجربه کنید؟ آرامش بیشتر؟
                اعتماد به نفس بیشتر؟ عشق بیشتر؟ انرژی بیشتر؟ درآمد بیشتر؟ سلامت
                بیشتر؟ شادی بیشتر؟ زندگی بهتر؟...
                <br /> جواب شما هر چه که هست تمام یا بخشی از زندگی ایده‌آل شماست
                و کار من این است که به شما یاد می دهم چطور زندگی ایده‌آلتان را
                برای خود خلق کنید. چه معامله‌ای از این بهتر؟
              </li>

              <br />
              <li className="questions">
                <b>آریانا از چه روشی برای کوچینگ استفاده می‌کند؟ </b>
              </li>
              <li style={{ listStyleType: "none" }}>
                روش کار من ترکیبی نوآورانه از روانشناسی مدرن، علم مغز و اعصاب،
                معنویت و ابزارهای کاربردی کوچینگ است. البته تجارب و آموخته‌هایی
                باارزش و مفید زندگی خودم را نیز به ‌این مجموعه اضافه می‌کنم.
              </li>
              <br />
              <li className="questions">
                <b>
                  کوچینگ با آریانا برای حل چه نوع مسایل و مشکلاتی مناسب است؟
                </b>
              </li>
              <li style={{ listStyleType: "none" }}>
                فکر می‌کنم با توجه به دانش گسترده و بروزی که در درک رفتارهای
                انسانی، طراحی و مدیریت زندگی، تغییر عادت‌ها، کوچینگ زندگی،
                کوچینگ سلامتی، تغذیه جامع، پیشگیری و بهداشت دارم، می‌توانم
                راهنمای خوبی برای ایجاد تعادل با مهمترین عناصر زندگی شما مثل
                عشق، روابط، معنویت، شغل، امور مالی و سلامتی باشم. من با صبر و
                مهربانی شما را یاری می‌دهم تا تغییراتی که زندگی شما را متحول
                می‌کنند، اجرایی کنید. بطور خلاصه موضوعات اشاره شده در زیر برخی
                از مواردی هستند که کوچینگ می‌تواند خیلی موثر باشد و من می‌توانم
                در این رابطه به شما کمک کنم:
                <ul
                  style={{
                    paddingRight: "1rem",
                    listStyleType: "square",
                    fontSize: "0.85rem",
                  }}
                >
                  <li>
                    اگر از نظر بالینی افسرده نیستید، اما صرف نظر از شرایط ظاهری
                    زندگی‌تان، احساس افسردگی مزمن درونی دارید،
                  </li>
                  <li>
                    اگر اصلا نمی‌دانید در زندگی خود چه می‌خواهید و احساس می‌کنید
                    گم شده‌اید،
                  </li>
                  <li>
                    اگر در تصمیم گیری‌های مهم در زندگی خود مشکل دارید و یا قادر
                    به تصمیم‌گیری نیستید،{" "}
                  </li>
                  <li>
                    اگر در پس زمینه زندگی‌تان احساس ناامنی، ترس یا استرس و
                    اضطراب دارید،
                  </li>
                  <li>
                    اگر در زمینه اعتماد به نفس و عزت نفس احساس کمبود دارید،
                  </li>
                  <li>
                    اگر مدیریت بهینه زمان را بلد نیستید و احساس می‌کنید بازدهی
                    پایینی دارید،
                  </li>
                  <li>
                    اگر چیزی (مثلا روابط شما) انرژی شما را تخلیه می‌کند اما
                    احساس می‌کنید در آن گیر افتاده‌اید و نمی‌دانید چه کنید،
                  </li>
                  <li>
                    اگر از شغل خود راضی نیستید، اما نمی‌دانید باید چه کرد و
                    احساس می‌کنید زندگی همین است،
                  </li>
                  <li>
                    اگر می‌دانید در زندگی چه می‌خواهید ولی نمی‌دانید چگونه بستر
                    مورد نیاز را فراهم کنید و یا قادر به حرکت رو به جلو در جهت
                    تحقق آن ویژن نیستید،
                  </li>
                  <li>
                    اگر زندگی امروز شما با زندگی ایده‌آلتان فاصله دارد، در
                    حالیکه احساس می‌کنید پتانسیل شما بیش از این است و این موضوع
                    عامل ایجاد استرس و باعث ناراحتی و آزار شماست،
                  </li>
                  <li>
                    اگر آن طوری که دوست دارید احساس شادابی، سبکی و سلامتی
                    ندارید، یا اکثر اوقات کم انرژی و خسته هستید،
                  </li>
                  <li>
                    اگر نحوه برخورد با بحران را بلد نیستید و در مواقع بحرانی
                    قادر به حفظ آرامش و ادامه حرکت در زندگی نیستید،
                  </li>
                  <li>
                    اگر دچار یک بیماری خطرناک شده‌اید و وحشت، ضعف و ناامیدی بر
                    شما غلبه کرده است و ابزارهای لازم برای رویارویی با این همه
                    فشار روحی و جسمی و پیدا کردن آرامش را ندارید،
                  </li>
                  <li>
                    اگر اضافه وزن دارید و این موضوع شما را آزار می‌دهد اما با
                    اینکه رژیم‌های مختلف می‌گیرید قادر به کاهش وزن نیستید...
                  </li>
                </ul>
              </li>
              <br />
              <li className="questions">
                <b>
                  چرا آریانا فرد مناسبی است که می‌تواند کمکم کند تا زندگیم را
                  متحول کنم و خواسته‌های قلبی خود را به حقیقت روزانه زندگیم گره
                  بزنم؟ چرا در میان خیل بیشماری از کوچ‌ها، معلم‌ها، روانشناس‌ها،
                  مشاورها و ... باید آریانا را انتخاب کنم؟
                </b>
              </li>
              <li style={{ listStyleType: "none" }}>
                به عناوین گوناگونی می‌توانم جواب این سوال بسیار خوب و بجا را
                بدهم. اما انتخاب می‌کنم که به ساده‌ترین و مستقیم‌ترین جواب اکتفا
                کنم: برای اینکه بیشتر از ده سال روی این موضوع تحقیق، تمرین و کار
                کرده ام. برای اینکه تک‌تک ابزارهایی که استفاده می‌کنم و مباحثی
                که تدریس می‌کنم بارها و بارها و بارها در زندگی خودم و سپس در
                زندگی کلاینت‌هایم امتحان کرده ام و به کاربردی بودن و موثر بودن
                آنها ایمان دارم. برای اینکه از حرف‌های مثبت و انگیزشی سطحی و پوچ
                و توخالی بیزارم. برای اینکه شاگرد همیشگی و سخت کوش مدرسه
                زندگی‌ام و دایما در حال یادگیری، رشد و تحول هستم. برای اینکه
                باور دارم خلق زندگی ایده‌آلم مهمترین کار و پروژه زندگی‌ام است و
                روزانه در جهتش قدم برمی‌دارم. یعنی هم شاگرد و هم معلم تمام مباحث
                و اصولی هستم که با شما کار می‌کنم...
              </li>
              <br />
              <li className="questions">
                <b>
                  چگونه می‌توانم بهترین انتخاب را در بین خدمات مختلف ارائه شده
                  داشته باشم؟ مثلا از کجا بفهمم کوچینگ خصوصی برای من بهتر جواب
                  می‌دهد یا کوچینگ گروهی و یا شرکت در دوره آنلاین؟
                </b>
              </li>
              <li style={{ listStyleType: "none" }}>
                جواب این سوال کاملا به موضوع و مسئله‌ای که می‌خواهید روی آن کار
                کنید بستگی دارد. اگر این موضوع در قالب دوره آنلاین می‌گنجد،
                سرمایه گذاری روی این دوره اولین پیشنهاد من است (با کلیک روی دوره
                آنلاین می‌توانید توضیحات مربوطه را مطالعه کنید و ببینید آیا مشکل
                و موضوع مد نظر شما در طی این دوره بحث و بررسی می‌شود یا خیر).
                برای این توصیه سه دلیل دارم:
                <ul style={{ listStyleType: "none" }}>
                  <li style={{ marginTop: "1.5rem" }}>
                    (۱) خرید در دوره آنلاین = کمترین سرمایه‌گذاری از جانب شما در
                    برابر حجم و کیفیت محتوایی که دریافت می‌کنید.
                  </li>
                  <li>
                    (۲) با خرید دوره آنلاین برای همیشه به دروس، تکالیف و منابع
                    ارزشمند ارائه شده دسترسی خواهید داشت و براحتی می‌توانید در
                    زمانهای مختلف، مثلا سالی یکبار، بدون پرداخت هزینه اضافی آنها
                    را مرور و آموخته‌های خود را عمیق‌تر کنید.{" "}
                  </li>
                  <li style={{ marginBottom: "1.5rem" }}>
                    (۳) با خرید دوره آنلاین می‌توانید با آرامش بیشتر و در
                    زمان‌ها، مکان‌ها و سرعت دلخواه خود در مباحث پیش بروید و دروس
                    را در زندگی خود پیاده کنید.
                  </li>
                </ul>
                <Link
                  to="/services"
                  style={{ textDecoration: "none" }}
                  state={{
                    link_tabNo: 2,
                  }}
                >
                  <ServiceButton
                    style={{
                      margin: "0.5rem auto 1rem auto",
                      fontFamily: "Vazir",
                    }}
                  >
                    دوره‌های آنلاین
                  </ServiceButton>
                </Link>
                اما اگر موضوع مورد نظر شما در قالب دوره آنلاین نمی‌گنجد پیشنهاد
                بعدی من شرکت در دوره‌های کوچینگ گروهی است (برای مطالعه چگونگی و
                موضوع‌های مورد بحث در دوره‌های کوچینگ گروهی، روی لینک زیر کلیک
                کنید).
                <Link
                  to="/services"
                  style={{ textDecoration: "none" }}
                  state={{
                    link_tabNo: 1,
                  }}
                >
                  <ServiceButton
                    style={{
                      margin: "2rem auto 1rem auto",
                      fontFamily: "Vazir",
                    }}
                  >
                    کوچینگ گروهی
                  </ServiceButton>
                </Link>
                اگر موضوع مورد نظر شما نه در دوره آنلاین و نه در کوچینگ گروهی
                می‌گنجد، کوچینگ خصوصی تنها گزینه شما خواهد بود.
                <Link
                  to="/services"
                  style={{ textDecoration: "none" }}
                  state={{
                    link_tabNo: 0,
                  }}
                >
                  <ServiceButton
                    style={{
                      margin: "2rem auto 1rem auto",
                      fontFamily: "Vazir",
                    }}
                  >
                    کوچینگ خصوصی
                  </ServiceButton>
                </Link>
                و نهایتاً اگر هنوز جواب خود را نگرفته‌اید و مطمئن نیستید کدام
                گزینه مناسب شماست از طریق لینک زیر با من تماس بگیرید تا کمکتان
                کنم.
                <Link to="/contact" style={{ textDecoration: "none" }}>
                  <ServiceButton
                    style={{
                      margin: "1rem auto 1rem auto",
                      fontFamily: "Vazir",
                    }}
                  >
                    تماس با من
                  </ServiceButton>
                </Link>
              </li>

              <br />
              <li className="questions">
                <b>آیا آریانا تحصیلاتی در زمینه روانشناسی و کوچینگ دارد؟</b>
              </li>

              <li style={{ listStyleType: "none" }}>
                بله. من علاوه بر دوره‌های کوتاه متعددی که در زمینه رشد فردی و
                روانشناسی، علم مغز و اعصاب، معنویت، فیزیک کوانتم، و سلامت جسم با
                اساتید برتر دنیا دیده ام، فارغ التحصیل مؤسسه مارتا بک در زمینه
                تخصص کوچینگ زندگی و موسسه تغذیه جامع نیویورک در زمینه تخصص
                کوچینگ سلامتی هستم. برای مطالعه بیشتر در این رابطه می‌توانید روی
                لینک زیر کلیک کنید.
                <Link
                  to="/about"
                  style={{ textDecoration: "none" }}
                  state={{
                    link_tabNo: 1,
                  }}
                >
                  <ServiceButton
                    style={{
                      margin: "2rem auto 1rem auto",
                      fontFamily: "Vazir",
                    }}
                  >
                    تحصیلات آریانا
                  </ServiceButton>
                </Link>
              </li>
            </ul>
          </Typography>
        </Paper>
      </CoachingWrapper>
    )
  }
}

// Coaching_Tab_Private_FR.propTypes = {
//   classes: PropTypes.object.isRequired,
// }

export default withStyles(stylesTheme)(CoachingTab_QnA_FR)

const CoachingWrapper = styled.div`
  .questions {
    color: green;
  }
  .buttons {
    display: flex;
    justify-content: space-around;
  }
  .paper {
    margin: 2rem auto;
    /* width: 900px; */
  }
  .text {
    margin-top: 1rem;
    line-height: 3rem;
    font-size: 1rem;
    /* font-weight: bold; */
    text-align: justify;
  }
  .textFR {
    direction: rtl;
    font-family: "Vazir";
  }
  .intro {
    margin-top: 1rem;
    /* font-size: 1.5rem; */
    /* text-align: center; */
  }
  .introFR {
    direction: rtl;
    font-family: "Vazir";
  }
  .underline {
    width: 10rem;
    height: 0.2rem;
    background: ${styles.colors.mainYellow};
    margin: 2rem auto;
  }
  .coachingType {
    margin: -0.5rem 0 -0.5rem 0;
    font-size: 0.8rem;
  }
  @media (min-width: 768px) {
    .paper {
      width: 80%;
    }
  }
  @media (min-width: 992px) {
    .paper {
      width: 70%;
    }
  }
  @media (min-width: 1292px) {
    .paper {
      width: 60%;
    }
  }
  @media (min-width: 1492px) {
    .paper {
      width: 50%;
    }
  }
  @media (max-width: 768px) {
    .paper {
      width: 90%;
    }
  }
`
