import React, { Component } from "react"
// import PropTypes from "prop-types"
import { withStyles } from "@material-ui/core/styles"
import Paper from "@material-ui/core/Paper"
import Typography from "@material-ui/core/Typography"
import classnames from "classnames"
import { styles, SectionButton } from "../../utils"
import { Link } from "gatsby"
import styled from "styled-components"

const stylesTheme = theme => ({
  root: {
    ...theme.mixins.gutters(),
    paddingTop: theme.spacing.unit * 2,
    paddingBottom: theme.spacing.unit * 2,
  },
})
class CoachingTab_OnlineCourses_FR extends Component {
  render() {
    const { classes } = this.props
    return (
      <CoachingWrapper>
        <Paper className={classnames(classes.root, "paper")} elevation={20}>
          <Typography
            variant="h5"
            component="h3"
            className={classnames("intro", "introFR")}
          >
            دوره آموزشی سفر خلق زندگی ایده آل
          </Typography>
          <Typography component="h3" className={classnames("text", "textFR")}>
            <p>
              این دوره آموزشی بصورت غیر حضوری و آنلاین برگزار می شود. یعنی با
              خرید این دوره در زمانها و مکانهای دلخواه خود و با هر سرعتی که
              مناسب شرایط زندگی شماست قادر به دنبال کردن مطالب و تکمیل دوره
              خواهید بود. طراحی این دوره به صورتی است که مطالب با بهترین کیفیت و
              بیانی گویا به شما انتقال داده می شود و توسط تمرینها و کار برگها
              بطور عملی با زندگی شما آمیخته می شود. بدین صورت با پرداخت هزینه ای
              بسیار کمتر از دوره های کوچینگ خصوصی و یا حتی کوچینگ گروهی می
              توانید از آموزشهای تحول برانگیز آریانا بهره مند شوید. خبر خوب
              اینکه با ثبت نام در این دوره به تمام محتوای آن برای همیشه دسترسی
              خواهید داشت و می توانید در زمانهای مختلف به این دروس رجوع کنید.{" "}
              <span style={{ color: "red", fontWeight: "bold" }}>
                همچنین اگر تا دو هفته پس از خرید این دوره، به هر دلیلی به این
                نتیجه رسیدید که این دوره آموزشی برای شما مفید نیست، تمام هزینه
                شما باز خواهد گشت.
              </span>
            </p>
            <Link
              to="/coaching.onlinecourses.request"
              style={{ textDecoration: "none" }}
              state={{
                coachingTypeRequest: "group-coaching",
              }}
            >
              <SectionButton style={{ margin: "2rem auto" }}>
                ثبت نام
                <h6 className="coachingType">
                  (دوره آموزشی: سفر خلق زندگی ایده آل)
                </h6>
              </SectionButton>
            </Link>
          </Typography>
          <br />
          <Typography
            variant="h5"
            component="h3"
            className={classnames("intro", "introFR")}
            style={{ color: "green" }}
          >
            این دوره آموزشی چیست؟{" "}
          </Typography>
          <Typography component="h3" className={classnames("text", "textFR")}>
            براستی آیا تا بحال با این فکر کرده اید که هدف از زندگیتان چیست؟ آیا
            ما به این دنیا آمده ایم که بعد از تحمل دوره ای رنج و سختی و بلا
            تکلیفی از این دنیا برویم؟ آیا ما به این دنیا آمده ایم که محکوم شرایط
            خانوادگی، اجتماعی، اقتصادی، سیاسی، جغرافیایی و ... باشیم و بعد از
            چند صباحی زندگی سخت نهایتاً به عنوان یک محکوم و کسی که قربانی شرایط
            محیطی است با روحی خسته و بدنی فرسوده رخت از دنیا برکنیم ! حقیقت این
            است که هیچ کدام از ما قربانی هیچ شرایطی نیستیم بلکه هر کدام از ما
            انسانهای فوق العاده قدرتمندی هستیم که از قدرت و حقیقت درونی خود بی
            اطلاعیم. هدف از زندگی تجربه عشق، شادی، لذت، سلامت، ثروت، موفقیت،
            حرکت، آرامش و بطور کلی تجربه انسان بودن است. به قول پیر تیلار دو
            شاردن دانشمند و فیلسوف فرانسوی «ما انسانهایی نیستیم که معنویت را
            تجربه می کنیم. ما موجودات معنوی هستیم که انسان بودن را تجربه می
            کنیم.»*. حقیقت این است که تجربه زنده بودن و زندگی کردن یک افتخار و
            شانسی بزرگ است. حقیقت این است که ما به این دنیا نیامده ایم که امتحان
            پس دهیم یا سختی بکشیم و بعد هم بازخواست و تنبیه شویم! ما به این دنیا
            آمده ایم برای لذت بردن و خلق زیبایی، برای تجربه عشق و عشق ورزیدن...
            اما متاسفانه خیلی زود در هیاهوی زندگی گم می شویم و این حقایق را
            فراموش می کنیم. در نتیجه این افتخار و شانس زنده بودن، بجای فرصتی
            برای تجربه لذت و خلق زیبایی، تبدیل به یک امتحان سخت، سفری پر مشقت و
            یا حتی زندانی خود ساخته می شود! حقیقت این است که همه ما لایق تجربه
            زندگی با رضایت و لذت هستیم و خلق چنین زندگی برای خود مسئولیت و وظیفه
            تک تک ماست. زمانیکه این مسئولیت را بپذیریم، نه تنها خودمان خدمت
            بزرگی کرده ایم، بلکه بزرگترین و ارزشمندترین خدمت را به جامعه انسانی
            و نسلهای آینده می کنیم. زمانیکه هر کدام از ما به خود فضا و اجازه
            درخشش دهیم و بالاترین پتانسیل خود را زندگی کنیم، حرکت زلزله گونه ای
            ایجاد می شود که لایه های تکتونیک رفتاری - برخوردی جامعه را در راستای
            بهبودی و روشنایی برای همگان دگرگون می کند.
          </Typography>
          <br />
          <Typography
            variant="h5"
            component="h3"
            className={classnames("intro", "introFR")}
            style={{ color: "green" }}
          >
            در این دوره آموزشی چه می آموزید؟{" "}
          </Typography>

          <Typography component="h3" className={classnames("text", "textFR")}>
            بطور خلاصه با شرکت در این دوره آموزشی یاد خواهید گرفت که چطور شیشه
            عینکی که زندگی و دنیای اطراف خود را با آن می بینید تمیز کنید تا دیدی
            واضح تر، شفاف تر، حقیقی تر و بی طرفانه نسبت به زندگی خود و دنیای
            اطراف پیدا کنید. در طی این دوره آریانا کوله بار شما را به ابزارهای
            ارزشمند کاربردی مجهز می کند تا بوسیله آنها بتوانید درکی شفاف از
            خواسته های قلبی خود داشته باشید، مقصد و ویژنی مشخص برای خود ترسیم
            کنید و حرکتی پایدار و سفری لذت بخش را برای خلق زندگی ایده آلتان آغاز
            کنید. این دوره علاوه بر مقدمه و جمع بندی، شامل چهار فصل اصلی است که
            هر فصل شامل مجموعه ای از ویدیوهای آموزشی، تمرینهای کاربردی، کاربرگ
            ها و منابع تکمیلی است. همچنین در این دوره به برخی سوالات مهم زندگی
            پاسخ داده می شود. سوالاتی از قبیل:
            <br />
            <ul
              style={{
                paddingRight: "1.2rem",
              }}
            >
              <li
                style={{
                  marginTop: "1.2rem",
                }}
              >
                منظور از زندگی ایده آل چیست؟ آیا اصلا تجربه چنین زندگی امکان
                پذیر است؟ آیا برای تجربه چنین زندگی باید ثروتمند و متمول بود و
                یا دسترسی به منابع خاصی داشت؟ آیا برای افرادی که در ایران با
                اینهمه چالش اقتصادی، اجتماعی و سیاسی دست و پنجه نرم می کنند می
                شود حرف از زندگی ایده آل زد؟ آیا سفر خلق زندگی ایده آل برای آنها
                هم امکان پذیر است؟ اصلاً زندگی ایده آل مخصوص چه کسانی است؟
              </li>

              <li
                style={{
                  marginTop: "1.2rem",
                }}
              >
                چرا تغییر دیدگاه مهم ترین قدم در سفر خلق زندگی ایده آل است؟ توسط
                چه دیدگاهی می توانیم زندگی ایده آل خود را درک کنیم؟ چگونه می
                توانیم خالق زندگی دلخواه و ایده آل خود باشیم؟ چگونه می توانیم
                خالق زندگی باشیم که در آن خواسته های عمیق قلبی خود را به واقعیت
                زندگی خود گره می زنیم؟{" "}
              </li>

              <li
                style={{
                  marginTop: "1.2rem",
                }}
              >
                آیا داشتن مقصدی معین برای رسیدن به جایی که روح و تمام وجود ما را
                ارضا می کند، ضروری است؟ چطور می توانیم این مقصد را برای خود مشخص
                کنیم؟ چطور مطمئن شویم مقصد را درست انتخاب کرده ایم و اگر مقصدی
                اشتباه برگزیدیم چه کنیم؟{" "}
              </li>
              <li
                style={{
                  marginTop: "1.2rem",
                }}
              >
                پس از بستن کوله باری مجهز برای سفر خلق زندگی ایده آل و تعیین
                مقصد (ویژن) روی نقشه زندگی، با چه استراتژی سفر را آغاز کنیم؟ و
                چطور مطمئن شویم که در مسیر درست در حال حرکت هستیم؟
              </li>
              <li
                style={{
                  marginTop: "1.2rem",
                }}
              >
                چگونه و با چه ابزارهایی با چالشهای مسیر و مسایلی که انرژی ما را
                تخلیه می کنند و مانع ادامه حرکت ما می شوند روبرو شویم؟ چگونه می
                توانیم با وجود همه مصائب با اقتدار به راه خود ادامه دهیم؟
              </li>
            </ul>
            <br />
          </Typography>
          <Typography
            variant="h6"
            component="h3"
            className={classnames("intro", "introFR")}
          >
            فصل اول: آماده سازی برای سفر{" "}
          </Typography>
          <Typography component="h3" className={classnames("text", "textFR")}>
            در این بخش آریانا از یافته های تکان دهنده علمی و ارتباط مستقیم آنها
            با زندگی روزمره ما صحبت خواهد کرد. این یافته های علمی شامل علم اِپی
            ژنتیک، کوانتم فیزیک، ریاضیات، علم مغز و اعصاب و مباحث عمیق دیگری است
            که حاصل سالها تحصیل و مطالعه آریانا، و ارتباط، همفکری و همکاری مداوم
            او با اساتید بسیار مشهور در دنیا است. شاید این سوال در ذهنتان ایجاد
            شود که چه نیازی به دانستن این دانشها و یافته های علمی است؟ جواب خیلی
            واضح و صریح است. بسیاری از افراد ذهنی جستجوگر و کم باور دارند. ذهن
            چنین افرادی تنها با رویارویی با واقعیت های علمی انکارناپذیر تغییر می
            کند. همچنین آریانا اعتقاد به این دارد که دانش همان قدرت است (دانش =
            قدرت) و برای شناخت قدرت درونی خود و بکارگیری آن نیاز به دانستن یافته
            های علمی است. به همین علت آریانا در این بخش به معرفی این یافته های
            مهم علمی می پردازد . در این بخش شما مجهز به دانش لازم برای تمیز کردن
            عینکی که از طریق آن زندگی و دنیای اطراف خود را می بینید می شوید. درک
            و توسعه این بینش که بر پایه یافته های معتبر علمی و همچنین تست شده در
            زندگی شخصی آریانا و کلاینتهایش است، به خودی خود رهایی بخش و تحول
            برانگیز است. اما اصلا نگران نشوید اگرچه این مطالب سنگین و پیچیده به
            نظر می آیند، آریانا به ساده ترین زبان ممکن آنها را به شما انتقال می
            دهد. تمام سعی آریانا بر این است که این مطالب قدرت بخش و تحول برانگیز
            را به ساده ترین و قابل فهم ترین شکل ممکن به تعداد بیشماری از شما
            عزیزان برساند تا بتوانید پر آرامش تر، موفق تر و شادتر زندگی کنید.
          </Typography>
          <br />
          <Typography
            variant="h6"
            component="h3"
            className={classnames("intro", "introFR")}
          >
            فصل دوم: انتخاب مقصد{" "}
          </Typography>
          <Typography component="h3" className={classnames("text", "textFR")}>
            در این بخش آریانا توسط تمرینها و کاربرگهای هدفمند به شما آموزش می
            دهد که چگونه خواسته های عمیق قلبی و احساسات مرتبط به آنها را از
            اعماق وجودتان حفاری کنید. سپس نحوه استفاده از آنها برای طرح ویژنی
            شفاف (مقصد اصلی زندگی) را به شما یاد می دهد. در این بخش ابزارهای
            کلیدی یاد خواهید گرفت که نه تنها در طی دوره بلکه در طول زندگیتان از
            آنها بهره خواهید برد.
          </Typography>
          <br />
          <Typography
            variant="h6"
            component="h3"
            className={classnames("intro", "introFR")}
          >
            فصل سوم: طراحی و انتخاب مسیرها و آغاز حرکت{" "}
          </Typography>
          <Typography component="h3" className={classnames("text", "textFR")}>
            در این بخش یاد خواهید گرفت که چگونه فعالانه خواسته های عمیق قلبی خود
            را به حقیقت زندگی روزمره خود گره بزنید و در مسیر خلق زندگی ایده آل
            خود حرکت کنید. حقیقت این است که زیباترین، عمیق ترین و شیرین ترین
            خواسته ها هم بدون اهداف مشخص کاربردی که براحتی قابل اجرا باشند، شما
            را به زندگی ایده آلتان نمی رسانند. اهداف مشخص کاربردی نیز اگر با
            خواسته های عمیق قلبی شما در هارمونی نباشند، مسلماً شما را به زندگی
            ایده آلتان نخواهند رساند! در این قسمت آریانا از راز پنهان هدف گذاری
            پرده برداری می کند و نحوه هدف گذاری موثر و حرکت پایدار در مسیر خلق
            زندگی ایده آل، یعنی حرکت در مسیر موفقیت را به شما آموزش می دهد.
          </Typography>
          <br />
          <Typography
            variant="h6"
            component="h3"
            className={classnames("intro", "introFR")}
          >
            فصل چهارم: نحوه رویارویی و عبور از چالشها در طی مسیر برای ادامه حرکت{" "}
          </Typography>
          <Typography component="h3" className={classnames("text", "textFR")}>
            طبیعتاً حرکت در مسیر خلق زندگی ایده آل مانند رانندگی با یک خودرو
            لوکس و راحت در اتوبانی شش بانده نیست! ممکن است در طی مسیر تصادف
            کنیم، ممکن است به جاده های پر دست انداز و خاکی برسیم، ممکن است به
            جای صعب العبوری برسیم که مجبور به جاده سازی شویم... در این بخش
            آریانا شما را مجهز به جعبه ابزار قدرتمندی می کند که توسط آن می
            توانید مصائب بر سر راه را حل کنید و به حرکت خود ادامه دهید.
          </Typography>
          <br />
          <Typography
            variant="h5"
            component="h3"
            className={classnames("intro", "introFR")}
            style={{ color: "green" }}
          >
            این دوره آموزشی برای چه افرادی مناسب است؟
          </Typography>
          <Typography component="h3" className={classnames("text", "textFR")}>
            <ul
              style={{
                paddingRight: "1.2rem",
              }}
            >
              <li>اگر در زندگی خود احساس ناآرامی و گمشدگی دارید،</li>
              <li>
                اگر احساس می کنید دقیقا نمی دانید چه می خواهید یا اصلا از کجا
                باید شروع کنید،
              </li>

              <li>
                اگر می دانید چه می خواهید و از کجا باید شروع کنید اما قادر به
                جلو رفتن در مسیر دلخواه خود نیستید یا براحتی تمرکز خود را از دست
                می دهید و از مسیر خارج می شوید،
              </li>
              <li>
                اگر احساس می کنید در شرایط حاضر زندگی گیر افتاده اید و راه خروجی
                برای خود نمی بینید،
              </li>
              <li>
                اگر زندگی امروز تان با زندگی ایده آلتان فاصله دارد، در حالیکه
                احساس می کنید پتانسیل شما بیش از این است و این باعث ایجاد استرس
                و ناراحتی شماست،
              </li>
              <li>
                اگر به هر علتی از جایگاه حاضر خود در زندگی ناراضی هستید و می
                خواهید در جهت بهبودی حرکت کنید.
              </li>
            </ul>
            <br />
          </Typography>
          <Typography
            variant="h5"
            component="h3"
            className={classnames("intro", "introFR")}
            style={{ color: "green" }}
          >
            چرا خرید این محصول بهترین سرمایه گذاری در زندگی شما خواهد شد؟
          </Typography>
          <Typography component="h3" className={classnames("text", "textFR")}>
            <p>
              کوتاه ترین جواب این است که: چون زندگی و نگرش شما را متحول خواهد
              کرد. چون به همه آنچه در زندگی برایتان مهم است خواهید رسید. چه چیزی
              را با همه وجودتان، با تک تک سلولهای بدنتان، می خواهید در زندگیتان
              تجربه کنید؟ آرامش بیشتر؟ اعتماد به نفس بیشتر؟ عشق بیشتر؟ موفقیت
              بیشتر؟ انرژی بیشتر؟ پول بیشتر؟ یا... جواب شما هر چه که هست تمام یا
              بخشی از زندگی ایده آل شماست و در این دوره آموزشی آریانا به شما یاد
              می دهد چطور زندگی ایده آلتان را برای خود خلق کنید! این محصول چکیده
              بیش از ۱۰ سال مطالعه، تحقیق و بررسی در زمینه رشد فردی و خلق زندگی
              ایده آل توسط آریانا است. در این دوره آموزشی آریانا سخاوتمندانه
              بهترین روشها و استراتژیهای خلق زندگی ایده آل را به شما آموزش می
              دهد. موفقیت روشها و تکنیکهای آریانا نه تنها توسط خود او و در زندگی
              شخصی اش امتحان شده، بلکه روی صدها کلاینتی که بطور خصوصی با او کار
              کرده اند هم جواب داده است. براستی حاضرید چقدر هزینه کنید تا:
            </p>
            <ul
              style={{
                paddingRight: "1.2rem",
              }}
            >
              <li>به خواسته های عمیق قلبی خود برسید؟</li>

              <li>
                تا یک زندگی با معنی، هدفمند، سرشار از آرامش، پر از لذت، پر
                انگیزه، و سرشار از شور و هیجان را تجربه کنید؟
              </li>

              <li>
                تا والاترین پتانسیل های بالقوه خود را بالفعل کنید و بدرخشید؟
              </li>
              <li>
                تا آرزوهای خود را به حقیقت زندگی خود گره بزنید و بطور مستمر در
                مسیر رشد و موفقیت قدم بردارید؟
              </li>
              <li>
                چگونه و با چه ابزارهایی با چالشهای مسیر و مسایلی که انرژی ما را
                تخلیه می کنند و مانع ادامه حرکت ما می شوند روبرو شویم؟ چگونه می
                توانیم با وجود همه مصائب با اقتدار به راه خود ادامه دهیم؟
              </li>
            </ul>
            <br />
            <p>
              لطفاً برای لحظاتی چشمان خود را ببندید، نفسی عمیق بکشید و صادقانه
              چنین دستاورد هایی را در ذهنتان ارزیابی و قیمت گذاری کنید! واقعیت
              محض این است که هیچ قیمتی نمی شود روی این دستاورد ها گذاشت! هیچ
              مقدار پول، الماس یا چیزی در این دنیا نیست که ارزشش با ارزش این
              دستاورد ها برابری کند... آریانا خالصانه، صادقانه و با تمام وجود می
              خواهد همه شما به نقشه و کلید طلایی خلق زندگی ایده آل خود دست پیدا
              کنید، و این دوره آموزشی را با قیمت فقط ۷۵۰،۰۰۰ تومان در اختیار شما
              قرار می دهد. کیفیت محتوا و کاربردی بودن این دوره تضمینی است و به
              همین دلیل اگر تا دو هفته پس از خرید این دوره، به این نتیجه رسیدید
              که این دوره آموزشی برای شما مناسب و مفید نیست، می توانید با تیم
              پشتیبان تماس بگیرید و هزینه پرداختی شما بطور کامل باز خواهد گشت.
              چه معامله ای از این بهتر؟ آیا واقعاً اگر با کمک این دوره آموزشی به
              خواسته های عمیق قلبی خود برسید، این بهترین سرمایه گذاری زندگی شما
              نخواهد بود؟
            </p>
            <br />
          </Typography>
          <Typography
            variant="h5"
            component="h3"
            className={classnames("intro", "introFR")}
            style={{ color: "green" }}
          >
            هدف آریانا از تهیه این دوره آموزشی علمی - کاربردی چیست؟{" "}
          </Typography>
          <Typography component="h3" className={classnames("text", "textFR")}>
            حقیقت این است که تعداد بسیار زیادی از شما عزیزان قادر به سرمایه
            گذاری خصوصی روی کوچینگ نیستید و آریانا با تمام وجود می خواهد این
            مطالب ارزشمند و ابزارهای کاربردی تحول برانگیز را به تعداد بیشماری از
            شما نازنینان آموزش دهد تا والاترین پتانسیلهای خود را دریابید، زندگی
            ایده آل خود را خلق کنید و از زندگی خود اوج لذت را ببرید. در طی چند
            سال گذشته آریانا درخواستهای بسیار زیادی از شما عزیزان دریافت می کرد
            که نیاز به کار کردن با او و کمک از او داشتید و این در خواستها هر روز
            و هر روز بیشتر می شود. اما متاسفانه وقت آریانا بسیار محدود است و
            تنها با عده معدودی در یک زمان خاص می تواند کار کند. مشکل دیگری هم
            وجود داشت و آن مساله هزینه های کار با آریانا بود. آریانا خارج از
            ایران زندگی میکند و تعداد بیشماری از عزیزانی که با او تماس میگرفتند
            ساکن ایران بودند. اما متاسفانه با توجه به ارزش پول پایین ایران در
            مقابل دلار، حتی پرداخت هزینه یک جلسه کوچینگ و مشاوره هم برایشان ممکن
            نبود. آریانا همواره از این قضیه رنج می برد و با تمام وجود تمایل داشت
            تا بتواند به تمام هموطنان عزیز خود نیز کمک کند. او ابتدا تصمیم گرفت
            تا بصورت محدود و با قیمتی بسیار کمتر قسمتی از وقت خود را فقط به
            کسانی اختصاص دهد که از ایران با او تماس میگیرند اما این شیوه نیز
            اصلا جوابگو نبود و تعداد در خواستها بسیار بیشتر از ظرفیتی بود که
            آریانا برای کار با عزیزان خود در نظر گرفته بود. سرانجام تلاش و تعهد
            شبانه روزی آریانا برای خدمت رسانی به هموطنان خود سبب شد تا ایده و
            فکر برگزاری دوره های آموزشی آنلاین به ذهن او خطور کند. آریانا مصمم
            است تا به بهترین شکل ممکن با شما عزیزان ارتباط برقرار کند و هر روز
            در تلاش است تا از تمام ظرفیتهای خود برای خدمت رسانی بیشتر به شما
            استفاده کند.
            <p>
              جهت ثبت نام و یا درخواست اطلاعات بیشتر لطفا از طریق لینک زیر اقدام
              کنید:
            </p>
            <Link
              to="/coaching.onlinecourses.request"
              style={{ textDecoration: "none" }}
              state={{
                coachingTypeRequest: "group-coaching",
              }}
            >
              <SectionButton style={{ margin: "2rem auto" }}>
                ثبت نام
                <h6 className="coachingType">
                  (دوره آموزشی: سفر خلق زندگی ایده آل)
                </h6>
              </SectionButton>
            </Link>
          </Typography>
          <br />
          <br />
        </Paper>
      </CoachingWrapper>
    )
  }
}

// Coaching_Tab_Private_FR.propTypes = {
//   classes: PropTypes.object.isRequired,
// }

export default withStyles(stylesTheme)(CoachingTab_OnlineCourses_FR)

const CoachingWrapper = styled.div`
  .buttons {
    display: flex;
    justify-content: space-around;
  }
  .paper {
    margin: 2rem auto;
    /* width: 900px; */
  }
  .text {
    margin-top: 1rem;
    line-height: 3rem;
    font-size: 1rem;
    /* font-weight: bold; */
    text-align: justify;
  }
  .textFR {
    direction: rtl;
    font-family: "Vazir";
  }
  .intro {
    margin-top: 1rem;
    /* font-size: 1.5rem; */
    /* text-align: center; */
  }
  .introFR {
    direction: rtl;
    font-family: "Vazir";
  }
  .underline {
    width: 10rem;
    height: 0.2rem;
    background: ${styles.colors.mainYellow};
    margin: 2rem auto;
  }
  .coachingType {
    margin: -0.5rem 0 -0.5rem 0;
    font-size: 0.8rem;
  }
  @media (min-width: 768px) {
    .paper {
      width: 80%;
    }
  }
  @media (min-width: 992px) {
    .paper {
      width: 70%;
    }
  }
  @media (min-width: 1292px) {
    .paper {
      width: 60%;
    }
  }
  @media (min-width: 1492px) {
    .paper {
      width: 50%;
    }
  }
  @media (max-width: 768px) {
    .paper {
      width: 90%;
    }
  }
`
