import React, { Component } from "react"
// import PropTypes from "prop-types"
import { withStyles } from "@material-ui/core/styles"
import Paper from "@material-ui/core/Paper"
import Typography from "@material-ui/core/Typography"
import classnames from "classnames"
import { styles } from "../../utils"
import { Link } from "gatsby"
import styled from "styled-components"

const stylesTheme = theme => ({
  root: {
    ...theme.mixins.gutters(),
    paddingTop: theme.spacing.unit * 2,
    paddingBottom: theme.spacing.unit * 2,
  },
})
class CoachingTab_QnA_FR extends Component {
  render() {
    const { classes } = this.props
    return (
      <CoachingWrapper>
         <Paper
                      className={classnames(classes.root, "paper")}
                      elevation={20}
                    >
                      <Typography
                        variant="h5"
                        component="h3"
                        className={classnames("intro", "introFR")}
                      >
                        پاسخ به سوالات متداول
                      </Typography>
                      <Typography
                        component="h3"
                        className={classnames("text", "textFR")}
                      >
                        اینها سوالاتی هستند که بصورت متداول از آریانا پرسیده شده
                        اند. بعضی از سوالها کمی تغییر داده شده اند تا بتوان
                        جوابهای کامل تری برای آنها ارایه داد.
                        <br />
                        <br />
                        <ul style={{ paddingRight: "1rem" }}>
                          <li>
                            <b>کوچینگ چیست؟</b>
                          </li>
                          <li style={{ listStyleType: "none" }}>
                            من برای کارم از واژه «کوچینگ» و عنوان شغلی «کوچ
                            زندگی و سلامت» استفاده می کنم اما راستش را بخواهید
                            فکر می کنم این واژه ها معرف های واضح و کاملی برای
                            شغل من نیستند! تنها دلیلی که از آنها استفاده می کنم
                            این است که واژه مناسب تری پیدا نکردم! و البته واژه
                            کوچینگ واژه نسبتا جا افتاده ای است که برخی افراد
                            برای خدماتی مشابه من استفاده می کنند! بالاخره من هم
                            باید یک عنوان شغلی داشته باشم و برای ارتباط برقرار
                            کردن با شما از کلمات نسبتا شناخته شده استفاده کنم!
                            <br /> اگر کنجکاو هستید بدانید کوچینگ چیست یا کار یک
                            کوچ زندگی چیست می توانید کلید واژه های «کوچینگ چیست»
                            و یا «فرق کوچ با مشاور چیست» را در گوگل جستجو کنید
                            تا جواب های تعریف شده و کلیشه ای را بیابید.
                            <br /> اما اگر جواب شخص من را می خواهید این است که
                            واژه ها را دور بریزید، ذهنتان را خالی کنید و کار با
                            من را برای خودتان تجربه کنید! چرا که روش کاری من
                            منحصر به فرد است و در هیچ جعبه از پیش تعریف شده ای
                            نمی گنجد!
                            <b style={{ color: "red" }}>
                              <br /> دعوتتان می کنم چند دقیقه ای وقت بگذارید و
                              تجربه کلاینتهایی که در انتهای کارشان با من تصمیم
                              گرفتند وقت بگذارند و چند خطی از نتیجه کار و تجربه
                              کلی خودشون از کار با من بنویسند را بخوانید.
                            </b>{" "}
                            <br />
                            سوال من از شما این است: چه چیزی را با همه وجودتان،
                            با تک تک سلولهای بدنتان، می خواهید در زندگیتان تجربه
                            کنید؟
                            <br />
                            آرامش بیشتر؟ اعتماد به نفس بیشتر؟ عشق بیشتر؟ انرژی
                            بیشتر؟ درآمد بیشتر؟ سلامت بیشتر؟ شادی بیشتر؟ زندگی
                            بهتر؟...
                            <br /> جواب شما هر چه که هست تمام یا بخشی از زندگی
                            ایده آل شماست و کار من این است که به شما یاد می دهم
                            چطور زندگی ایده آلتان را برای خود خلق کنید. چه
                            معامله ای از این بهتر؟
                          </li>
                          <br />
                          <li>
                            <b>
                              چرا آریانا بهترین فردی است که می تواند کمکم کند
                              زندگیم را متحول کنم و خواسته های قلبیم را به حقیقت
                              روزانه زندگیم گره بزنم؟ چرا در میان خیل بیشماری از
                              کوچها، معلم ها، روانشناسها، مشاورها و ... باید
                              آریانا را انتخاب کنم؟
                            </b>
                          </li>
                          <li style={{ listStyleType: "none" }}>
                            به عنواین گوناگونی می توانم جواب این سوال بسیار خوب
                            و بجا را بدهم. اما انتخاب می کنم که به ساده ترین و
                            مستقیم ترین جواب اکتفا کنم: برای اینکه حدود بیست سال
                            روی این موضوع تحقیق، تمرین و کار کرده ام. برای اینکه
                            تک تک ابزارهایی که استفاده میکنم و مباحثی که تدریس
                            می کنم بارها و بارها و بارها در زندگی خودم و سپس در
                            زندگی کلاینتهایم امتحان کرده ام و به کاربردی بودن و
                            موثر بودن آنها ایمان دارم. برای اینکه از حرفهای مثبت
                            و انگیزشی سطحی و پوچ و تو خالی بیزارم. برای اینکه
                            شاگرد همیشگی و سخت کوش مدرسه زندگی و دایما در حال
                            یادگیری، رشد و تحول هستم. برای اینکه باور دارم خلق
                            زندگی ایده آلم مهمترین کار و پروژه زندگی ام است و
                            روزانه در جهتش قدم بر میدارم. یعنی هم شاگرد و هم
                            معلم تمام مباحث و اصولی هستم که با شما کار می کنم...
                          </li>
                          <br />
                          <li>
                            <b>آریانا از چه روشی برای کوچینگ استفاده می کند؟</b>
                          </li>
                          <li style={{ listStyleType: "none" }}>
                            روش کار من ترکیبی نوآورانه از روانشناسی مدرن، علم
                            مغز و اعصاب، معنویت و ابزارهای کاربردی کوچینگ است.
                            البته تجارب و آ موخته های باارزش و مفید زندگی خودم
                            را نیز به این مجموعه اضافه می کنم.
                          </li>
                          <br />
                          <li>
                            <b>
                              کوچینگ با آریانا برای حل چه نوع مسایل و مشکلاتی
                              مناسب است؟
                            </b>
                          </li>
                          <li style={{ listStyleType: "none" }}>
                            فکر می کنم با توجه به دانش گسترده و به روزی که در
                            درک رفتارهای انسانی، طراحی و مدیریت زندگی، تغییر
                            عادات، کوچینگ زندگی، کوچینگ سلامتی ، تغذیه جامع،
                            پیشگیری و بهداشت دارم، می توانم راهنمای شما برای
                            ایجاد تعادل با مهمترین عناصر زندگی خود مثل عشق،
                            روابط، معنویت، شغل، امور مالی و سلامتی باشم. من با
                            صبر و مهربانی شما را یاری می دهم تا تغییراتی که
                            زندگی شما را متحول می کنند اجرایی کنید. بطور خلاصه
                            اینها می توانند فقط برخی از دلایلی باشند که شما را
                            از خدمات من بهره مند کنند:
                            <ul
                              style={{
                                paddingRight: "1rem",
                                listStyleType: "square",
                                fontSize: "0.85rem",
                              }}
                            >
                              <li>
                                اگر از نظر بالینی افسرده نیستید، اما صرف نظر از
                                شرایط ظاهری زندگی اتان، احساس افسردگی مزمن درونی
                                دارید،
                              </li>
                              <li>
                                اگر اصلا نمیدانید در زندگی اتان چه می خواهید و
                                احساس می کنید گم شده اید،
                              </li>
                              <li>
                                اگر در تصمیم گیریهای مهم در زندگی اتان می لنگید،{" "}
                              </li>
                              <li>
                                اگر در پس زمینه زندگی تان احساس نا امنی، ترس یا
                                حتی اضطراب دارید،
                              </li>
                              <li>
                                اگر در زمینه اعتماد به نفس و عزت نفس احساس کمبود
                                دارید،
                              </li>
                              <li>
                                اگر مدیریت بهینه زمان را بلد نیستید و احساس می
                                کنید بازدهی اتان پایین است،{" "}
                              </li>
                              <li>
                                اگر چیزی (مثلا روابط شما) انرژی شما را تخلیه می
                                کند و احساس می کنید گیر افتا ده اید،
                              </li>
                              <li>
                                اگر از شغل خود راضی نیستید، اما نمی دانید باید
                                چه کرد و احساس می کنید زندگی همین است،
                              </li>
                              <li>
                                اگر می دانید در زندگی چه می خواهید ولی نمی دانید
                                چگونه بستر مورد نیاز را فرا هم کنید و در جهت
                                تحقق آن قدم بر دارید،
                              </li>
                              <li>
                                اگر آن طوری که دوست دارید احساس شادابی، سبکی و
                                سلامتی ندارید، یا اکثر اوقات کم انرژی و خسته
                                هستید
                              </li>
                              <li>
                                اگر نحوه برخورد با بحران را بلد نیستید و در
                                همچین مواقعی قادر به حفظ آرامش و ادامه حرکت در
                                زندگی اتان نیستید،
                              </li>
                              <li>
                                اگر دچار یک بیماری خطرناک شده اید و وحشت و ضعف و
                                ناامیدی بر شما غلبه کرده است و ابزارهای لازم
                                برای رویارویی با این همه فشار روحی و جسمی و پیدا
                                کردن آرامش را ندارید.
                              </li>
                              <li>
                                اگر اضافه وزن دارید و این موضوع باعث آزارتان است
                                اما با اینکه رژیم های مختلف می گیرید قادر به
                                کاهش وزن نیستید
                              </li>
                            </ul>
                          </li>
                          <br />
                          <li>
                            <b>
                              آیا آریانا تحصیلاتی در زمینه روانشناسی و کوچینگ
                              دارد؟
                            </b>
                          </li>

                          <li style={{ listStyleType: "none" }}>
                            بله. اطلاعات کامل و لیست اساتیدی که افتخار شاگردیشان
                            را داشته ام را در بخش{" "}
                            <Link
                              to="/about"
                              style={{ textDecoration: "none" }}
                              onClick={() => {
                                // setAboutArianaTabNo(1)
                              }}
                              state={{
                                tabNo: 1,
                              }}
                            >
                              درباره آریانا (تحصیلات)
                            </Link>{" "}
                            بخوانید.
                          </li>
                        </ul>
                      </Typography>
                    </Paper>
      </CoachingWrapper>
    )
  }
}

// Coaching_Tab_Private_FR.propTypes = {
//   classes: PropTypes.object.isRequired,
// }

export default withStyles(stylesTheme)(CoachingTab_QnA_FR)

const CoachingWrapper = styled.div`
  .buttons {
    display: flex;
    justify-content: space-around;
  }
  .paper {
    margin: 2rem auto;
    /* width: 900px; */
  }
  .text {
    margin-top: 1rem;
    line-height: 3rem;
    font-size: 1rem;
    /* font-weight: bold; */
    text-align: justify;
  }
  .textFR {
    direction: rtl;
    font-family: "Vazir";
  }
  .intro {
    margin-top: 1rem;
    /* font-size: 1.5rem; */
    /* text-align: center; */
  }
  .introFR {
    direction: rtl;
    font-family: "Vazir";
  }
  .underline {
    width: 10rem;
    height: 0.2rem;
    background: ${styles.colors.mainYellow};
    margin: 2rem auto;
  }
  .coachingType {
    margin: -0.5rem 0 -0.5rem 0;
    font-size: 0.8rem;
  }
  @media (min-width: 768px) {
    .paper {
      width: 80%;
    }
  }
  @media (min-width: 992px) {
    .paper {
      width: 70%;
    }
  }
  @media (min-width: 1292px) {
    .paper {
      width: 60%;
    }
  }
  @media (min-width: 1492px) {
    .paper {
      width: 50%;
    }
  }
  @media (max-width: 768px) {
    .paper {
      width: 90%;
    }
  }
`
